---
type: ExternalDefinitionCreationOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# ExternalDefinitionCreationOptions

`Autodesk.Revit.DB.ExternalDefinitionCreationOptions` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExternalDefinitionCreationOptions | 2015 | `public ExternalDefinitionCreationOptions ( string name , ForgeTypeId dataType )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetDataType | 2015 | `public ForgeTypeId GetDataType ()` |
| Method | SetDataType | 2015 | `public void SetDataType ( ForgeTypeId dataType )` |
| Property | Description | 2015 | `public string Description { get ; set ; }` |
| Property | GUID | 2015 | `public Guid GUID { get ; set ; }` |
| Property | HideWhenNoValue | 2020 | `public bool HideWhenNoValue { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | 2015 | `public string Name { get ; set ; }` |
| Property | UserModifiable | 2015 | `public bool UserModifiable { get ; set ; }` |
| Property | Visible | 2015 | `public bool Visible { get ; set ; }` |